# UniqueElementFailures Properties

---
The BuiltInFailuresUniqueElementFailures type exposes the following members.
| Name| Description
---|---|---
| ProhibitUniqueElementDeletion|  Internal setting '%1!s!' is required by Revit and has been deleted.
Top
#### Reference
BuiltInFailuresUniqueElementFailures Class
Autodesk.Revit.DB Namespace